# Direction Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaReinforcement..::..Direction Property
AreaReinforcement Class See Also
---
Retrieve the Major Direction of the Area Reinforcement.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Direction { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Direction As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Direction {
	XYZ^ get ();
}
```

# See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace